//4 Знайти елемент із найбільшою частотою повторень

function MaxNumOfEl(arr){
    let num = arr[0] //перший елемент масиву
    let max_frq = 1 //зустрічається 1 раз (поточний максимум)
    let N = arr.length
    for (let i=0; i < N-1; i++) {
        let frq = 1 //поточний елемент зустрічається 1 раз
        for (let k = i+1; k<N; k++) 
            if (arr[i] == arr[k])//  перевіряємо чи є одинакові елементи
                frq += 1 //якщо так , то змінну frq збільшуємо на 1 
        if (frq > max_frq) {
            max_frq = frq // якщо елемент зустрічається більше раз за значення змінної max_frq, max_frq = frq
            num = arr[i] // змінній num присвоюємо значення елемента з найбільшим числом повторень
        }
    }  
    console.log(num+' зустрічається  '+max_frq+' рази') 
}
    
let arr1 = [0,0,1, 3, 4, 1, 1, 3, 4, 5];
let arr2 = [0,0,6,7,7,7,1, 3, 4, 1, 1, 3, 4, 5,7];

MaxNumOfEl(arr1)
MaxNumOfEl(arr2)